In [2]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    'Col1': [100, 200, 300],
    'Col2': [400, 500, 600],
    'Col3': [700, 800, 900]
}, index=['fila1', 'fila2', 'fila3'])

df

       Col1  Col2  Col3
fila1   100   400   700
fila2   200   500   800
fila3   300   600   900

In [8]:
df.loc["fila1"]

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [12]:
type(df.loc["fila1"])

pandas.core.series.Series

In [20]:
df.loc[["fila1","fila3"]]

       Col1  Col2  Col3
fila1   100   400   700
fila3   300   600   900

In [22]:
type(df.loc[["fila1","fila3"]])

pandas.core.frame.DataFrame

In [24]:
df.loc["fila2":"fila3"]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [26]:
df.loc[[False,True,False]]

       Col1  Col2  Col3
fila2   200   500   800

In [28]:
df.loc[df["Col1"] > 150 ]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [32]:
df.loc[:, ["Col1","Col2"] ]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

In [34]:
df.iloc[0]

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [36]:
df.iloc[:,[0,1]]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

In [38]:
df.iloc[1:3]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900